-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 09 2023 г., 18:29
-- Версия сервера: 10.4.26-MariaDB-log
-- Версия PHP: 7.4.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `home`
--

-- --------------------------------------------------------

--
-- Структура таблицы `partner`
--

CREATE TABLE `partner` (
  `id` int(11) NOT NULL COMMENT 'Идентификатор',
  `name` varchar(254) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'Наименование поставщика услуг',
  `web` varchar(254) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Домашняя страница',
  `inn` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ИНН',
  `login` varchar(254) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'Логин',
  `pass` varchar(254) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Пароль',
  `personal_account` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Лицевой счет',
  `active` enum('0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0' COMMENT 'Текущий поставщик услуг',
  `service` varchar(254) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'Оказываемая услуга',
  `place` enum('ЖКХ','УК') COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `partner`
--

INSERT INTO `partner` (`id`, `name`, `web`, `inn`, `login`, `pass`, `personal_account`, `active`, `service`, `place`) VALUES
(1, 'ООО «ЕРЦ г. Тольятти»', 'https://ikvp.ru/?username=63107022145&password=42306500', '6321427356', '63107022145', '42306500', NULL, '1', 'Содержание', 'ЖКХ'),
(2, '«Квартплата 24», АО «АЛЬФА-БАНК»', 'https://xn--80afnfom.xn--80ahmohdapg.xn--80asehdb/login', '7728168971', '', '', '30262884434', '1', 'Отопление', 'ЖКХ'),
(3, 'ООО «Волжские коммунальные системы»', NULL, '6312101799', '', NULL, '63207022145', '1', 'Вода', 'ЖКХ'),
(4, 'НКО «Фонд капитального ремонта»', NULL, '7720367661', '', NULL, '517189707096507', '1', 'Капремонт', 'ЖКХ'),
(5, 'ООО «Газпром межрегионгаз Самара»', 'https://мойгаз.смородина.онлайн/login', '6310000026', '163034021534', 'kC9mERm3', '163034021534', '1', 'Газ', 'ЖКХ'),
(6, 'ООО «ЭкоСтройРесурс»', NULL, '6316186232', '', NULL, '10930007932', '1', 'ТКО', 'ЖКХ'),
(7, 'ПАО «Ростелеком»', 'https://lk.rt.ru/?utm_source=invoice&utm_medium=email&utm_campaign=lk.rt&utm_content=vl_01', '', 'deryabino@gmail.com', 'BigOleksha2017', NULL, '1', 'Интернет', 'ЖКХ'),
(8, 'ПАО «Самараэнерго»', 'https://lk.samaraenergo.ru/sap/bc/ui5_ui5/sap/z_umcui5_v02/index.html', '6315222985', '050900691990', '868885', '050900691990', '1', 'Электроэнергия', 'ЖКХ'),
(9, 'ООО «Цифрал-Автоград»', 'https://cyfral-group.ru/', '6321181007', '', NULL, '048627', '1', 'Домофон', 'ЖКХ'),
(10, 'ООО «РКЦ УК-3»', 'https://ikvp.ru/', '6324011758', '70527702167', '61950', '63507702167', '1', 'Содержание', 'УК'),
(11, 'НКО «Фонд капитального ремонта»', NULL, '7720367661', '', NULL, '500019802104803', '1', 'Капремонт', 'УК'),
(12, 'ООО «Волжские коммунальные системы»', 'https://www.ikvp.ru/', '6312101799', '63214423645', '42135', '63214423645', '1', 'Вода', 'УК'),
(13, '«Квартплата 24», АО «АЛЬФА-БАНК»', 'https://xn--80afnfom.xn--80ahmohdapg.xn--80asehdb/login', '7728168971', '30138030185', '2XFWD4H', '30138030185', '1', 'Отопление', 'УК'),
(14, 'ООО «Газпром межрегионгаз Самара»', 'https://мойгаз.смородина.онлайн/login', '6310000026', '163034021536', '3uEz6RM2', '163034021536', '1', 'Газ', 'УК'),
(15, 'ООО «Средневолжская газовая компания»', 'https://svgk.ru/personal/', '6314012801', 'oleksha', '07051967', '32-653923', '1', 'ГазТО', 'УК'),
(16, 'ООО «ЭкоСтройРесурс»', NULL, '6316186232', '', NULL, '10930136471', '1', 'ТКО', 'УК'),
(17, 'ПАО «Самараэнерго»', 'https://lk.samaraenergo.ru/sap/bc/ui5_ui5/sap/z_umcui5_v02/index.html', '6315222985', '050900300580', '117686', '050900300580', '1', 'Электроэнергия', 'УК'),
(18, 'ООО «Цифрал-Автоград»', 'https://cyfral-group.ru/', '6321181007', '', NULL, '200508', '1', 'Домофон', 'УК');

-- --------------------------------------------------------

--
-- Структура таблицы `payment`
--

CREATE TABLE `payment` (
  `id` int(11) NOT NULL COMMENT 'Идентификатор',
  `year` varchar(4) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Год',
  `month` varchar(2) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Месяц',
  `name` enum('ЖКХ','УК') COLLATE utf8mb4_unicode_ci NOT NULL,
  `service` varchar(254) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Оплачиваемая услуга',
  `id_partner` int(11) DEFAULT NULL COMMENT 'Контрагент',
  `summa` double(11,2) DEFAULT NULL COMMENT 'Сумма',
  `commission` double(11,2) DEFAULT NULL COMMENT 'Комиссия',
  `date_pay` date DEFAULT NULL COMMENT 'Дата оплаты'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `payment`
--

INSERT INTO `payment` (`id`, `year`, `month`, `name`, `service`, `id_partner`, `summa`, `commission`, `date_pay`) VALUES
(13, '2023', '3', 'ЖКХ', 'Содержание', 1, 2231.41, 0.00, '2023-04-13'),
(14, '2023', '3', 'ЖКХ', 'Вода', 3, 389.59, 0.00, '2023-04-13'),
(15, '2023', '3', 'ЖКХ', 'Отопление', 2, 2312.98, 0.00, '2023-04-13'),
(16, '2023', '3', 'ЖКХ', 'Капремонт', 4, 593.97, 0.00, '2023-04-13'),
(17, '2023', '3', 'ЖКХ', 'Газ', 5, 122.97, 0.00, '2023-04-13'),
(18, '2023', '3', 'ЖКХ', 'ТКО', 6, 307.57, 0.00, '2023-04-13'),
(19, '2023', '3', 'ЖКХ', 'Электроэнергия', 8, 473.76, 0.00, '2023-04-13'),
(20, '2023', '3', 'ЖКХ', 'Интернет', 7, 570.00, 0.00, '2023-04-13'),
(21, '2023', '3', 'УК', 'Содержание', 10, 1010.41, 0.00, '2023-04-13'),
(22, '2023', '3', 'УК', 'Капремонт', 11, 340.56, 0.00, '2023-04-13'),
(23, '2023', '3', 'УК', 'Вода', 12, 261.13, 0.00, '2023-04-13'),
(24, '2023', '3', 'УК', 'Газ', 14, 231.92, 0.00, '2023-04-13'),
(25, '2023', '3', 'УК', 'ГазТО', 15, 28.45, 0.00, '2023-04-13'),
(26, '2023', '3', 'УК', 'ТКО', 16, 202.85, 0.00, '2023-04-13'),
(27, '2023', '3', 'УК', 'Электроэнергия', 17, 312.48, 0.00, '2023-04-13'),
(28, '2023', '2', 'УК', 'Электроэнергия', 17, 332.64, 0.00, '2023-03-11'),
(29, '2023', '2', 'УК', 'ТКО', 16, 202.85, 0.00, '2023-03-11'),
(30, '2023', '2', 'УК', 'ГазТО', 15, 28.45, 0.00, '2023-03-11'),
(31, '2023', '2', 'УК', 'Газ', 14, 115.96, 0.00, '2023-03-11'),
(32, '2023', '2', 'УК', 'Отопление', 13, 1155.47, 0.00, '2023-03-11'),
(33, '2023', '2', 'УК', 'Вода', 12, 238.34, 0.00, '2023-03-11'),
(34, '2023', '2', 'УК', 'Капремонт', 11, 340.56, 0.00, '2023-03-11'),
(35, '2023', '2', 'УК', 'Содержание', 10, 1010.41, 0.00, '2023-03-11'),
(36, '2023', '2', 'ЖКХ', 'Интернет', 7, 570.00, 0.00, '2023-03-11'),
(37, '2023', '2', 'ЖКХ', 'Электроэнергия', 8, 549.36, 0.00, '2023-03-11'),
(38, '2023', '2', 'ЖКХ', 'ТКО', 6, 307.57, 0.00, '2023-03-11'),
(39, '2023', '2', 'ЖКХ', 'Газ', 5, 62.44, 0.00, '2023-03-11'),
(40, '2023', '2', 'ЖКХ', 'Капремонт', 4, 593.97, 0.00, '2023-03-11'),
(41, '2023', '2', 'ЖКХ', 'Отопление', 2, 2268.00, 0.00, '2023-03-11'),
(42, '2023', '2', 'ЖКХ', 'Вода', 3, 372.30, 0.00, '2023-03-11'),
(43, '2023', '2', 'ЖКХ', 'Содержание', 1, 1908.06, 0.00, '2023-03-11'),
(44, '2023', '1', 'УК', 'Домофон', 18, 924.00, 0.00, '2023-05-09'),
(45, '2023', '1', 'УК', 'Электроэнергия', 17, 317.52, 0.00, '2023-05-09'),
(46, '2023', '1', 'УК', 'ГазТО', 15, 28.45, 0.00, '2023-05-09'),
(47, '2023', '1', 'УК', 'ТКО', 16, 202.85, 0.00, '2023-05-09'),
(48, '2023', '1', 'УК', 'Газ', 14, 115.96, 0.00, '2023-05-09'),
(49, '2023', '1', 'УК', 'Отопление', 13, 1108.44, 0.00, '2023-05-09'),
(50, '2023', '1', 'УК', 'Вода', 12, 77.86, 0.00, '2023-05-09'),
(51, '2023', '1', 'УК', 'Содержание', 10, 1010.41, 0.00, '2023-05-09'),
(52, '2023', '1', 'УК', 'Капремонт', 11, 340.56, 0.00, '2023-05-09'),
(53, '2023', '1', 'ЖКХ', 'Домофон', 9, 816.00, 0.00, '2023-05-09'),
(54, '2023', '1', 'ЖКХ', 'Интернет', 7, 570.00, 0.00, '2023-05-09'),
(55, '2023', '1', 'ЖКХ', 'Электроэнергия', 8, 670.32, 0.00, '2023-05-09'),
(56, '2023', '1', 'ЖКХ', 'Газ', 5, 58.01, 0.00, '2023-05-09'),
(57, '2023', '1', 'ЖКХ', 'ТКО', 6, 307.57, 0.00, '2023-05-09'),
(58, '2023', '1', 'ЖКХ', 'Капремонт', 4, 593.97, 0.00, '2023-05-09'),
(59, '2023', '1', 'ЖКХ', 'Отопление', 2, 2299.06, 0.00, '2023-05-09'),
(60, '2023', '1', 'ЖКХ', 'Вода', 3, 402.17, 0.00, '2023-05-09'),
(61, '2023', '1', 'ЖКХ', 'Содержание', 1, 1939.74, 0.00, '2023-05-09');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `partner`
--
ALTER TABLE `partner`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `payment`
--
ALTER TABLE `payment`
  ADD PRIMARY KEY (`id`),
  ADD KEY `partner` (`id_partner`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `partner`
--
ALTER TABLE `partner`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор', AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT для таблицы `payment`
--
ALTER TABLE `payment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор', AUTO_INCREMENT=62;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `payment`
--
ALTER TABLE `payment`
  ADD CONSTRAINT `partner` FOREIGN KEY (`id_partner`) REFERENCES `partner` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
